In [1]:
import pandas as pd

# Series

In [21]:
data = range(1, 6)

In [22]:
s = pd.Series(data)

In [23]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Personalizando o index de uma Series

In [24]:
index = ['linha-' + str(i) for i in range(5)]

In [25]:
index

['linha-0', 'linha-1', 'linha-2', 'linha-3', 'linha-4']

In [26]:
s = pd.Series(data = data, index = index)

In [27]:
s

linha-0    1
linha-1    2
linha-2    3
linha-3    4
linha-4    5
dtype: int64

In [32]:
data = {'Linha' + str(i) : i+1 for i in range(1, 5)}

In [33]:
data

{'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [34]:
s = pd.Series(data)

In [35]:
s

Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

### Operações com valores de uma Series

In [38]:
s1 = s+2
s1

Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [39]:
s2 = s1 / s
s2

Linha1    2.000000
Linha2    1.666667
Linha3    1.500000
Linha4    1.400000
dtype: float64

## DataFrame

In [41]:
data = [range(1, 4), 
        range(4, 7), 
        range(7, 10)]

In [42]:
data

[range(1, 4), range(4, 7), range(7, 10)]

In [43]:
df1 = pd.DataFrame(data = data)

In [44]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### Personalizando o index de um DataFrame

In [46]:
index = ['Linha-' + str(i) for i in range(3)]
index

In [53]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha-0  1  2  3
Linha-1  4  5  6
Linha-2  7  8  9

In [52]:
columns = ['Coluna-' + str(i) for i in range(3)]
columns

['Coluna-0', 'Coluna-1', 'Coluna-2']

In [54]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

         Coluna-0  Coluna-1  Coluna-2
Linha-0         1         2         3
Linha-1         4         5         6
Linha-2         7         8         9

In [59]:
data = {'Coluna-0': {'Linha-0': 1, 'Linha-1': 4, 'Linha-2': 7},
        'Coluna-1': {'Linha-0': 2, 'Linha-1': 5, 'Linha-2': 8},
        'Coluna-2': {'Linha-0': 3, 'Linha-1': 6, 'Linha-2': 9}}
data

{'Coluna-0': {'Linha-0': 1, 'Linha-1': 4, 'Linha-2': 7},
 'Coluna-1': {'Linha-0': 2, 'Linha-1': 5, 'Linha-2': 8},
 'Coluna-2': {'Linha-0': 3, 'Linha-1': 6, 'Linha-2': 9}}

In [60]:
df2 = pd.DataFrame(data)
df2

         Coluna-0  Coluna-1  Coluna-2
Linha-0         1         2         3
Linha-1         4         5         6
Linha-2         7         8         9

In [61]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [62]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

         Coluna-0  Coluna-1  Coluna-2
Linha-0         1         2         3
Linha-1         4         5         6
Linha-2         7         8         9

In [63]:
df1[df1>0] = 'A'
df1

        Coluna-0 Coluna-1 Coluna-2
Linha-0        A        A        A
Linha-1        A        A        A
Linha-2        A        A        A

In [64]:
df2[df2>0] = 'B'
df2

        Coluna-0 Coluna-1 Coluna-2
Linha-0        B        B        B
Linha-1        B        B        B
Linha-2        B        B        B

In [65]:
df3[df3>0] = 'C'
df3

        Coluna-0 Coluna-1 Coluna-2
Linha-0        C        C        C
Linha-1        C        C        C
Linha-2        C        C        C

In [68]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna-0 Coluna-1 Coluna-2
Linha-0        A        A        A
Linha-1        A        A        A
Linha-2        A        A        A
Linha-0        B        B        B
Linha-1        B        B        B
Linha-2        B        B        B
Linha-0        C        C        C
Linha-1        C        C        C
Linha-2        C        C        C

In [69]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

,Coluna-0,Coluna-1,Coluna-2,Coluna-0,Coluna-1,Coluna-2,Coluna-0,Coluna-1,Coluna-2
Linha-0,A,A,A,B,B,B,C,C,C
Linha-1,A,A,A,B,B,B,C,C,C
Linha-2,A,A,A,B,B,B,C,C,C